Autodesk.Revit.DB.RevitLinkOperations.SetGetLocalPathForOpenCallback(Autodesk.Revit.DB.IGetLocalPathForOpenCallback)
Sets the IGetLocalPathForOpenCallback that will support the "Open (and Unload)" command for Revit links
obtained from an IExternalResourceServer.
makeLocalCopyForOpen:
The IGetLocalPathForOpenCallback that will support the "Open (and Unload)" command.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.RevitLinkOperations
This class is used to extend the IExternalResourceServer interface with methods to support operations
specifically related to Revit links.
Remarks:
The class owns single-method interfaces which are used as callbacks to perform specific operations
on Revit link external resources.
An empty RevitLinkOperations instance is passed to an IExternalResourceServer (inside an
ExternalResourceServerExtensions object) via the GetTypeSpecificServerOperations method.  The server
provider can then add their own implemented interface objects to the RevitLinkOperations, thus
making them available to Revit to use as callbacks.
Supporting these additional, type-specific operations is not absolutely required, but is strongly
recommended in order for users to be able to perform all the same operations they would with
locally-accessed Revit links.
Since:
2015